import re

#  Ввести в терминал, чтобы запустить для разных IP:
#  $env:FLASK_APP="main.py"; flask run --host=0.0.0.0 --port=8000

#  Ввести в терминал, чтобы запустить локально:
#  flask --app main run

APPEND = "APPEND"
MODIFY = "MODIFY"
CHECK = "CHECK"

ORDERS_XLSX_PATH = r"db\orders.xlsx"
ACCOUNTS_XLSX_PATH = r"db\accounts.xlsx"

STORAGE_XLSX_PATH = r"db\storage.xlsx"
INGREDIENT_NAME_COLUMN_INDEX = 0
INGREDIENT_AMOUNT_COLUMN_INDEX = 1
INGREDIENT_CODE_ING_CHAR_INDEX = 0
INGREDIENT_CODE_AMT_START_INDEX = 1
PLACEHOLDER_STORAGE_ITEM_AMOUNT = 100

test_name = lambda x: bool(re.fullmatch(r'[А-Яа-яЁё-]+', x))
test_surname = lambda x: bool(re.fullmatch(r'[А-Яа-яЁё-]+', x))
test_lastname = lambda x: bool(re.fullmatch(r'[А-Яа-яЁё-]+', x))
test_phone = lambda x: bool(re.fullmatch(r'^[\d\s\-\(\)\+]+$', x))
test_email = lambda x: bool(re.fullmatch(r'^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$', x))

MENU = {"Маргарита": 1100, "Пепперони не острая": 1000, "Тесто": 100,
        "Пицца с ананасами": 900, "Вода": 100, "Сок": 200, "Кидс": 950, "Мясная пицца": 1010, "Деревенская пицца": 1050,
        "Сырная пицца": 1199, "Гавайская пицца": 1259}
SPEC_MENU = {"Маргарита с весом 100 тонн": 5000, "Газировка": 300, "Пепперони очень острая": 1100, "Лимонад": 259}
INGREDIENTS = {"Колбаса": 100, "Грибы": 120, "Огурцы": 80, "Кетчуп": 40, "Майонез": 30, "Сыр": 50, "Оливки": 20,
               "Горчица": 90, "Бекон": 110, "Помидоры": 70, "Лук": 30, "Шпинат": 40}

# Т - Тесто
# К - Колбаса
# Г - Грибы
# О - Огурцы
# Е - Кетчуп
# М - Майонез
# С - Сыр
# И - Оливки
# Р - Горчица
# Б - Бекон
# П - Помидоры
# Л - Лук
# Ш - Шпинат
# А - Ананасы
# В - Вода
# Д - Сок
# Ю - Газировка
# Я - Лимонад
food_ingreds = {
    "Маргарита": ("Т1", "С3", "П2", "И1"),
    "Пепперони не острая": ("Т1", "К2", "С3", "П1"),
    "Тесто": ("Т1",),
    "Пицца с ананасами": ("Т1", "С2", "П1", "А2"),
    "Вода": ("В1",),
    "Сок": ("Д1",),
    "Кидс": ("Т1", "С2", "П1"),
    "Мясная пицца": ("Т1", "К2", "Б1", "С3", "Л1"),
    "Деревенская пицца": ("Т1", "К1", "Б1", "Г2", "С3", "П2"),
    "Сырная пицца": ("Т1", "С5"),
    "Гавайская пицца": ("Т1", "С3", "П1", "А3", "К1"),
    "Маргарита с весом 100 тонн": ("Т10", "С30", "П20", "И10"),
    "Газировка": ("Ю1",),
    "Пепперони очень острая": ("Т1", "К3", "С3", "П1", "Р1"),
    "Лимонад": ("Я1",),
    "Колбаса": ("К1",),
    "Грибы": ("Г1",),
    "Огурцы": ("О1",),
    "Кетчуп": ("Е1",),
    "Майонез": ("М1",),
    "Сыр": ("С1",),
    "Оливки": ("И1",),
    "Горчица": ("Р1",),
    "Бекон": ("Б1",),
    "Помидоры": ("П1",),
    "Лук": ("Л1",),
    "Шпинат": ("Ш1",)
}
ingredient_code_transcript = {
    'К': "Колбаса",
    'Г': "Грибы",
    'О': "Огурцы",
    'Е': "Кетчуп",
    'М': "Майонез",
    'С': "Сыр",
    'И': "Оливки",
    'Р': "Горчица",
    'Б': "Бекон",
    'П': "Помидоры",
    'Л': "Лук",
    'Ш': "Шпинат",
    'А': "Ананасы",
    'Т': "Тесто",
    'В': "Вода",
    'Д': "Сок",
    'Ю': "Газировка",
    'Я': "Лимонад",
}